const ru = {
	loginPage: {
		title: 'Войти',
		subtitle: 'чтобы воспользоваться GraphiQL 🚀',
		emailPlaceHold: 'Эл. почта',
		passPlaceHold: 'Пароль',
		btnTitle: 'Войти',
		linkClue: 'Ещё нет аккаунта?',
		linkTitle: 'Зарегистрироваться',
	},
	signUpPage: {
		title: 'Зарегистрироваться',
		subtitle: 'чтобы воспользоваться GraphiQL 🚀',
		emailPlaceHold: 'Эл. почта',
		passPlaceHold: 'Пароль',
		confPassPlaceHold: 'Подтв. пароль',
		btnTitle: 'Зарегистрироваться',
		linkClue: 'Уже есть аккаунт?',
		linkTitle: 'Войти',
	},
	settingsPage: {
		headers: {
			title: 'Сохранять заголовки',
			firstSub: 'Сохранять заголовки после перезагрузки.',
			secondSub: 'Включайте, только если доверяете устройству.',
		},
		mode: {
			title: 'Тёмная тема',
			subtitle: 'Изменить внешний вид интерфейса.',
		},
		endpoint: {
			title: 'API endpoint',
			subtitle: 'Сменить API endpoint.',
		},
		lang: {
			title: 'Локализация',
			subtitle: 'Сменить локализацию.',
		},
		clear: {
			title: 'Очистить хранилище',
			subtitle: 'Очистить все локалько сохранённые данные.',
			btn: 'Очистить',
			modal: {
				title: 'Очистить данные',
				subtitle: 'Вы уверены, что хотити удалить все локальные данные?',
				cancel: 'Отмена',
				confirm: 'Очистить',
			},
			undo: {
				undoTitle: 'Данные хранилища очищены',
				cancelBtn: 'Отменить',
			},
		},
	},
};

export default ru;
