const ru = {
	nav: {
		navbar: {
			welcome: 'Главная',
			settings: 'Настройки',
		},
		viewList: {
			title: 'Недавние',
			addNewView: 'Новый редактор',
			newView: 'Пустой редактор',
			rename: 'Переименовать',
			delete: 'Удалить',
			renameDialog: {
				title: 'Переименовать редактор',
				cancel: 'Отмена',
				rename: 'Переименовать',
				snackbar: 'Переименовано в',
			},
			deleteDialog: {
				title: 'Удалить редактор?',
				content:
					'Вы больше не увидите этот редактор. Это также удалит связанную активность, такую как заголовки, ответы и переменные.',
				cancel: 'Отмена',
				delete: 'Удалить',
				snackbar: 'Удалено',
			},
		},
	},
	loginPage: {
		title: 'Войти',
		subtitle: 'чтобы воспользоваться GraphiQL 🚀',
		emailPlaceHold: 'Эл. почта',
		passPlaceHold: 'Пароль',
		btnTitle: 'Войти',
		linkClue: 'Ещё нет аккаунта?',
		linkTitle: 'Зарегистрироваться',
	},
	signUpPage: {
		title: 'Зарегистрироваться',
		subtitle: 'чтобы воспользоваться GraphiQL 🚀',
		emailPlaceHold: 'Эл. почта',
		passPlaceHold: 'Пароль',
		confPassPlaceHold: 'Подтв. пароль',
		btnTitle: 'Зарегистрироваться',
		linkClue: 'Уже есть аккаунт?',
		linkTitle: 'Войти',
	},
	header: { h1: { h2: 'русский' } },
};

export default ru;
